-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: May 09, 2023 at 11:48 PM
-- Server version: 8.0.33
-- PHP Version: 8.2.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `web23`
--

-- --------------------------------------------------------

--
-- Table structure for table `nested_category`
--

DROP TABLE IF EXISTS `nested_category`;
CREATE TABLE IF NOT EXISTS `nested_category` (
  `db_category_id` bigint NOT NULL AUTO_INCREMENT,
  `gen_cat_scraper_id` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sub_cat_scraper_id` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `subcatBelongsToCatId` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category_name` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `lft` bigint NOT NULL,
  `rgt` bigint NOT NULL,
  `dateInserted` datetime DEFAULT NULL,
  PRIMARY KEY (`db_category_id`),
  UNIQUE KEY `db_category_id` (`db_category_id`),
  UNIQUE KEY `gen_cat_scraper_id` (`gen_cat_scraper_id`),
  UNIQUE KEY `sub_cat_scraper_id` (`sub_cat_scraper_id`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `nested_category`
--

INSERT INTO `nested_category` (`db_category_id`, `gen_cat_scraper_id`, `sub_cat_scraper_id`, `subcatBelongsToCatId`, `category_name`, `lft`, `rgt`, `dateInserted`) VALUES
(1, '8016e637b54241f8ad242ed1699bf2da', NULL, NULL, 'Βρεφικά Είδη', 1, 18, '2023-05-09 16:07:03'),
(2, 'a8ac6be68b53443bbd93b229e2f9cd34', NULL, NULL, 'Ποτά - Αναψυκτικά', 33, 46, '2023-05-09 16:07:03'),
(3, '8e8117f7d9d64cf1a931a351eb15bd69', NULL, NULL, 'Προσωπική φροντίδα', 47, 92, '2023-05-09 16:07:03'),
(4, 'ee0022e7b1b34eb2b834ea334cda52e7', NULL, NULL, 'Τρόφιμα', 93, 218, '2023-05-09 16:07:03'),
(5, 'e4b4de2e31fc43b7b68a0fe4fbfad2e6', NULL, NULL, 'Αντισηπτικά', 219, 222, '2023-05-09 16:07:03'),
(6, '2d5f74de114747fd824ca8a6a9d687fa', NULL, NULL, 'Προστασία Υγείας', 223, 226, '2023-05-09 16:07:03'),
(7, '662418cbd02e435280148dbb8892782a', NULL, NULL, 'Για κατοικίδια', 227, 232, '2023-05-09 16:07:03'),
(8, NULL, '991276688c8c4a91b5524b1115122ec1', '8016e637b54241f8ad242ed1699bf2da', 'Απορρυπαντικά', 2, 3, '2023-05-09 16:07:03'),
(9, NULL, 'e0efaa1776714351a4c17a3a9d412602', '8016e637b54241f8ad242ed1699bf2da', 'Πάνες', 4, 5, '2023-05-09 16:07:03'),
(10, NULL, 'fc71b59318b5410d8ed9da8b42904d77', '8016e637b54241f8ad242ed1699bf2da', 'Γάλα', 6, 7, '2023-05-09 16:07:03'),
(11, NULL, 'ddb733df68324cfc8469c890b32e716d', '8016e637b54241f8ad242ed1699bf2da', 'Περιποιήση σώματος', 8, 9, '2023-05-09 16:07:03'),
(12, NULL, '3d0c29b055f8417eb1c679fbfdc37da0', '8016e637b54241f8ad242ed1699bf2da', 'Σαμπουάν - Αφρόλουτρα', 10, 11, '2023-05-09 16:07:03'),
(13, NULL, '724700777199431e9d42861b2ed63cd5', '8016e637b54241f8ad242ed1699bf2da', 'Γιαούρτια', 12, 13, '2023-05-09 16:07:03'),
(14, NULL, '92680b33561c4a7e94b7e7a96b5bb153', '8016e637b54241f8ad242ed1699bf2da', 'Μωρομάντηλα', 14, 15, '2023-05-09 16:07:03'),
(15, NULL, '7e86994327f64e3ca967c09b5803966a', '8016e637b54241f8ad242ed1699bf2da', 'Βρεφικές τροφές', 16, 17, '2023-05-09 16:07:03'),
(16, NULL, '329bdd842f9f41688a0aa017b74ffde4', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Μπύρες', 34, 35, '2023-05-09 16:07:03'),
(17, NULL, 'bc4d21162fbd4663b0e60aa9bd65115e', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Εμφιαλωμένα νερά', 36, 37, '2023-05-09 16:07:03'),
(18, NULL, '3d01f4ce48ad422b90b50c62b1f8e7f2', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Κρασιά', 38, 39, '2023-05-09 16:07:03'),
(19, NULL, '08f280dee57c4b679be0102a8ba1343b', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Ποτά', 40, 41, '2023-05-09 16:07:03'),
(20, NULL, '4f1993ca5bd244329abf1d59746315b8', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Χυμοί', 42, 43, '2023-05-09 16:07:03'),
(21, NULL, '3010aca5cbdc401e8dfe1d39320a8d1a', 'a8ac6be68b53443bbd93b229e2f9cd34', 'Αναψυκτικά - Ενεργειακά Ποτά', 44, 45, '2023-05-09 16:07:03'),
(22, NULL, '35410eeb676b4262b651997da9f42777', '8e8117f7d9d64cf1a931a351eb15bd69', 'Αποσμητικά', 48, 49, '2023-05-09 16:07:03'),
(23, NULL, 'af538008f3ab40989d67f971e407a85c', '8e8117f7d9d64cf1a931a351eb15bd69', 'Βαμβάκια', 50, 51, '2023-05-09 16:07:03'),
(24, NULL, '09f2e090f72c4487bc44e5ba4fcea466', '8e8117f7d9d64cf1a931a351eb15bd69', 'Βαφές μαλλιών', 52, 53, '2023-05-09 16:07:03'),
(25, NULL, 'cf079c66251342b690040650104e160f', '8e8117f7d9d64cf1a931a351eb15bd69', 'Κρέμες μαλλιών', 54, 55, '2023-05-09 16:07:03'),
(26, NULL, 'a610ce2a98a94ee788ee5f94b4be82c2', '8e8117f7d9d64cf1a931a351eb15bd69', 'Λοιπά προϊόντα', 56, 57, '2023-05-09 16:07:03'),
(27, NULL, 'f4d8a256e3944c05a3e7b8904b863882', '8e8117f7d9d64cf1a931a351eb15bd69', 'Υγρομάντηλα', 58, 59, '2023-05-09 16:07:03'),
(28, NULL, '2df01835007545a880dc43f69b5cae07', '8e8117f7d9d64cf1a931a351eb15bd69', 'Ξυριστικά - Αποτριχωτικά', 60, 61, '2023-05-09 16:07:03'),
(29, NULL, '6db091264f494c86b9cf22a562593c82', '8e8117f7d9d64cf1a931a351eb15bd69', 'Οδοντόβουρτσες', 62, 63, '2023-05-09 16:07:03'),
(30, NULL, '0bf072374a8e4c40b915e4972990a417', '8e8117f7d9d64cf1a931a351eb15bd69', 'Πάνες ενηλίκων', 64, 65, '2023-05-09 16:07:03'),
(31, NULL, '5a2a0575959c40d6a46614ab99b2d9af', '8e8117f7d9d64cf1a931a351eb15bd69', 'Περιποίηση προσώπου', 66, 67, '2023-05-09 16:07:03'),
(32, NULL, '5935ab588fa444f0a71cc424ad651d12', '8e8117f7d9d64cf1a931a351eb15bd69', 'Προϊόντα μαλλιών', 68, 69, '2023-05-09 16:07:03'),
(33, NULL, '46b02b6b4f4c4d5d8a0efe21d0981027', '8e8117f7d9d64cf1a931a351eb15bd69', 'Σαμπουάν - Αφρόλουτρα', 70, 71, '2023-05-09 16:07:03'),
(34, NULL, 'de77af9321844b1f863803f338f4a0c2', '8e8117f7d9d64cf1a931a351eb15bd69', 'Κρέμα ημέρας', 72, 73, '2023-05-09 16:07:03'),
(35, NULL, 'c44b50bef9674aaeb06b578122bf4445', '8e8117f7d9d64cf1a931a351eb15bd69', 'Κρέμα Σώματος', 74, 75, '2023-05-09 16:07:03'),
(36, NULL, 'e2f81e96f70e45fb9552452e381529d3', '8e8117f7d9d64cf1a931a351eb15bd69', 'Αντρική περιποίηση', 76, 77, '2023-05-09 16:07:03'),
(37, NULL, '1b59d5b58fb04816b8f6a74a4866580a', '8e8117f7d9d64cf1a931a351eb15bd69', 'Επίδεσμοι', 78, 79, '2023-05-09 16:07:03'),
(38, NULL, 'fefa136c714945a3b6bcdcb4ee9e8921', '8e8117f7d9d64cf1a931a351eb15bd69', 'Κρέμες ενυδάτωσης', 80, 81, '2023-05-09 16:07:03'),
(39, NULL, '9c86a88f56064f8588d42eee167d1f8a', '8e8117f7d9d64cf1a931a351eb15bd69', 'Κρεμοσάπουνα - Σαπούνι', 82, 83, '2023-05-09 16:07:03'),
(40, NULL, '7cfab59a5d9c4f0d855712290fc20c7f', '8e8117f7d9d64cf1a931a351eb15bd69', 'Προφυλακτικά', 84, 85, '2023-05-09 16:07:03'),
(41, NULL, '2bce84e7df694ab1b81486aa2baf555d', '8e8117f7d9d64cf1a931a351eb15bd69', 'Σερβιέτες', 86, 87, '2023-05-09 16:07:03'),
(42, NULL, '181add033f2d4d95b46844abf619dd30', '8e8117f7d9d64cf1a931a351eb15bd69', 'Στοματικά διαλύματα', 88, 89, '2023-05-09 16:07:03'),
(43, NULL, '26e416b6efa745218f810c34678734b2', '8e8117f7d9d64cf1a931a351eb15bd69', 'Στοματική υγιεινή', 90, 91, '2023-05-09 16:07:03'),
(44, NULL, 'c761cd8b18a246eb81fb21858ac10093', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Αλεύρι - Σιμιγδάλι', 94, 95, '2023-05-09 16:07:03'),
(45, NULL, 'be04eae3ca484928a86984d73bf3cc3a', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Αλλαντικά', 96, 97, '2023-05-09 16:07:03'),
(46, NULL, '6d2babbc7355444ca0d27633207e4743', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Αυγά', 98, 99, '2023-05-09 16:07:03'),
(47, NULL, 'a240e48245964b02ba73d1a86a2739be', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Βούτυρο - Μαργαρίνη', 100, 101, '2023-05-09 16:07:03'),
(48, NULL, '0364b4be226146699140e81a469d04a1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Γιαούρτια', 102, 103, '2023-05-09 16:07:03'),
(49, NULL, 'a1a1c2c477b74504b58ad847f7e0c8e1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Είδη Ζαχαροπλαστικής', 104, 105, '2023-05-09 16:07:03'),
(50, NULL, 'dca17e0bfb4e469c93c011f8dc8ab512', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Γλυκά/Σοκολάτες', 106, 107, '2023-05-09 16:07:03'),
(51, NULL, '509b949f61cc44f58c2f25093f7fc3eb', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Επιδόρπια', 108, 109, '2023-05-09 16:07:03'),
(52, NULL, '1eef696c0f874603a59aed909e1b4ce2', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Έτοιμα γεύματα/Σούπες', 110, 111, '2023-05-09 16:07:03'),
(53, NULL, '0c347b96540a427e9823f321861ce58e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ζυμαρικά', 112, 113, '2023-05-09 16:07:03'),
(54, NULL, 'e63b2caa8dd84e6ea687168200859baa', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Γλυκά/Κέικ', 114, 115, '2023-05-09 16:07:03'),
(55, NULL, '3f38edda7854447a837956d64a2530fa', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Πίτσες', 116, 117, '2023-05-09 16:07:03'),
(56, NULL, 'd1315c04b3d64aed93472e41d6e5a6f8', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Φύλλα - Βάσεις', 118, 119, '2023-05-09 16:07:03'),
(57, NULL, 'b89cb8dd198748dd8c4e195e4ab2168e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Καφέδες', 120, 121, '2023-05-09 16:07:03'),
(58, NULL, 'df10062ca2a04789bd43d18217008b5f', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κονσέρβες', 122, 123, '2023-05-09 16:07:03'),
(59, NULL, '463e30b829274933ab7eb8e4b349e2c5', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Τυποποιημένα κρεατικά', 124, 125, '2023-05-09 16:07:03'),
(60, NULL, '4e4cf5616e0f43aaa985c1300dc7109e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κρέμες γάλακτος', 126, 127, '2023-05-09 16:07:03'),
(61, NULL, '1e9187fb112749ff888b11fd64d79680', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Λάδι', 128, 129, '2023-05-09 16:07:03'),
(62, NULL, '50e8a35122854b2b9cf0e97356072f94', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Όσπρια', 130, 131, '2023-05-09 16:07:03'),
(63, NULL, 'bc66b1d812374aa48d6878730497ede7', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Παγωτά', 132, 133, '2023-05-09 16:07:03'),
(64, NULL, '7cfe21f0f1944b379f0fead1c8702099', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Καραμέλες - Τσίχλες', 134, 135, '2023-05-09 16:07:03'),
(65, NULL, '5dca69b976c94eccbf1341ee4ee68b95', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ξύδι', 136, 137, '2023-05-09 16:07:03'),
(66, NULL, '3935d6afbf50454595f1f2b99285ce8c', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κύβοι', 138, 139, '2023-05-09 16:07:03'),
(67, NULL, '5aba290bf919489da5810c6122f0bc9b', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Πελτές τομάτας', 140, 141, '2023-05-09 16:07:03'),
(68, NULL, 'f6007309d91c4410adf000ffd5e8129e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Πουρές', 142, 143, '2023-05-09 16:07:03'),
(69, NULL, '2d711ee19d17429fa7f964d56fe611db', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ροφήματα', 144, 145, '2023-05-09 16:07:03'),
(70, NULL, '5d0be05c3b414311bcda335b036202f1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ρύζι', 146, 147, '2023-05-09 16:07:03'),
(71, NULL, 'ea47b5f0016f4f0eb79e3a4b932f7577', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Αρτοσκευάσματα', 148, 149, '2023-05-09 16:07:03'),
(72, NULL, 'f87bed0b4b8e44c3b532f2c03197aff9', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Γαριδάκια', 150, 151, '2023-05-09 16:07:03'),
(73, NULL, '19c54e78d74d4b64afbb1fd124f01dfc', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Κρουασάν', 152, 153, '2023-05-09 16:07:03'),
(74, NULL, 'ec9d10b5d68c4d8b8998d51bf6d67188', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Πατατάκια', 154, 155, '2023-05-09 16:07:03'),
(75, NULL, '8851b315e2f0486180be07facbc3b21f', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Ποπ κορν', 156, 157, '2023-05-09 16:07:03'),
(76, NULL, '4c73d0eccd1e4dde8bb882e436a64ebb', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Τυριά', 158, 159, '2023-05-09 16:07:03'),
(77, NULL, '0e1982336d8e4bdc867f1620a2bce3be', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φούρνος/Τσουρέκια', 160, 161, '2023-05-09 16:07:03'),
(78, NULL, 'c928573dd7bc4b7894d450eadd7f5d18', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φούρνος/Ψωμί', 162, 163, '2023-05-09 16:07:03'),
(79, NULL, 'a02951b1c083449b9e7fab2fabd67198', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Χυμός τομάτας', 164, 165, '2023-05-09 16:07:03'),
(80, NULL, '2ad2e93c1c0c41b4b9769fe06c149393', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Μπαχαρικά', 166, 167, '2023-05-09 16:07:03'),
(81, NULL, 'df433029824c4b4194b6637db26f69eb', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Μπάρες - Ράβδοι', 168, 169, '2023-05-09 16:07:03'),
(82, NULL, 'b1866f1365a54e2d84c28ad2ca7ab5af', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ειδική διατροφή', 170, 171, '2023-05-09 16:07:03'),
(83, NULL, 'b3992eb422c2495ca02dd19de9d16ad1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Γάλα', 172, 173, '2023-05-09 16:07:03'),
(84, NULL, 'e397ddcfb34a4640a42b8fa5e999b8c8', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Γλυκά αλλείματα', 174, 175, '2023-05-09 16:07:03'),
(85, NULL, '916a76ac76b3462baf2db6dc508b296b', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Δημητριακά', 176, 177, '2023-05-09 16:07:03'),
(86, NULL, '4f205aaec31746b89f40f4d5d845b13e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Έτοιμα γεύματα/Σαλάτες', 178, 179, '2023-05-09 16:07:03'),
(87, NULL, '5c5e625b739b4f19a117198efae8df21', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Πατάτες', 180, 181, '2023-05-09 16:07:03'),
(88, NULL, '7ca5dc60dd00483897249e0f8516ee91', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Ψάρια', 182, 183, '2023-05-09 16:07:03'),
(89, NULL, '6d084e8eab4945cdb4563d7ff49f0dc3', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Λαχανικά', 184, 185, '2023-05-09 16:07:04'),
(90, NULL, '1eb56e6ffa2a449296fb1acc7b714cc5', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Πίτες', 186, 187, '2023-05-09 16:07:04'),
(91, NULL, 'ce4802b6c9f44776a6e572b3daf93ab1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σάλτσες - Dressings', 188, 189, '2023-05-09 16:07:04'),
(92, NULL, '35cce434592f489a9ed37596951992b3', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Σνάκς/Μπισκότα', 190, 191, '2023-05-09 16:07:04'),
(93, NULL, 'a885d8cd1057442c9092af37e79bf7a7', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Ζάχαρη - Υποκατάστατα ζάχαρης', 192, 193, '2023-05-09 16:07:04'),
(94, NULL, 'bcebd8cc2f554017864dbf1ce0069ac5', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φούρνος/Παξιμάδια', 194, 195, '2023-05-09 16:07:04'),
(95, NULL, 'a483dd538ecd4ce0bdbba36e99ab5eb1', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φούρνος/Φρυγανίες', 196, 197, '2023-05-09 16:07:04'),
(96, NULL, '9b7795175cbc4a6d9ca37b8ee9bf5815', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Κατεψυγμένα/Κρεατικά', 198, 199, '2023-05-09 16:07:04'),
(97, NULL, 'c487e038079e407fb1a356599c2aec3e', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Αφρόψαρο', 200, 201, '2023-05-09 16:07:04'),
(98, NULL, '3d22916b908b40b385bebe4b478cf107', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Ψάρι', 202, 203, '2023-05-09 16:07:04'),
(99, NULL, '8ef82da99b284c69884cc7f3479df1ac', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Κοτόπουλο', 204, 205, '2023-05-09 16:07:04'),
(100, NULL, '0936072fcb3947f3baf83e31bb5c1cab', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Αρνί', 206, 207, '2023-05-09 16:07:04'),
(101, NULL, 'd3385ff161f0423aa364017d4413fa77', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Κατσίκι', 208, 209, '2023-05-09 16:07:04'),
(102, NULL, 'a73f11a7f08b41c081ef287009387579', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Χοιρινό', 210, 211, '2023-05-09 16:07:04'),
(103, NULL, 'c2ce05f4653c4f4fa8f39892bbb98960', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Μοσχάρι', 212, 213, '2023-05-09 16:07:04'),
(104, NULL, '9bc82778d6b44152b303698e8f72c429', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Λαχανικά', 214, 215, '2023-05-09 16:07:04'),
(105, NULL, 'ea47cc6b2f6743169188da125e1f3761', 'ee0022e7b1b34eb2b834ea334cda52e7', 'Φρέσκα/Φρούτα', 216, 217, '2023-05-09 16:07:04'),
(106, NULL, '8f1b83b1ab3e4ad1a62df8170d1a0a25', 'e4b4de2e31fc43b7b68a0fe4fbfad2e6', 'Αντισηπτικά', 220, 221, '2023-05-09 16:07:04'),
(107, NULL, '79728a412a1749ac8315501eb77550f9', '2d5f74de114747fd824ca8a6a9d687fa', 'Μάσκες Προσώπου', 224, 225, '2023-05-09 16:07:04'),
(108, NULL, '926262c303fe402a8542a5d5cf3ac7eb', '662418cbd02e435280148dbb8892782a', 'Pet shop/Τροφή γάτας', 228, 229, '2023-05-09 16:07:04'),
(109, NULL, '0c6e42d52765495dbbd06c189a4fc80f', '662418cbd02e435280148dbb8892782a', 'Pet shop/Τροφή σκύλου', 230, 231, '2023-05-09 16:07:04'),
(110, 'd41744460283406a86f8e4bd5010a66d', NULL, NULL, 'Καθαριότητα', 19, 32, '2023-05-09 16:09:11'),
(111, NULL, '3be81b50494d4b5495d5fea3081759a6', 'd41744460283406a86f8e4bd5010a66d', 'Είδη γενικού καθαρισμού', 30, 31, '2023-05-09 16:09:11'),
(112, NULL, '034941f08ca34f7baaf5932427d7e635', 'd41744460283406a86f8e4bd5010a66d', 'Χαρτικά', 28, 29, '2023-05-09 16:09:11'),
(113, NULL, '21051788a9ff4d5d9869d526182b9a5f', 'd41744460283406a86f8e4bd5010a66d', 'Αποσμητικά Χώρου', 26, 27, '2023-05-09 16:09:11'),
(114, NULL, '8f98818a7a55419fb42ef1d673f0bb64', 'd41744460283406a86f8e4bd5010a66d', 'Εντομoκτόνα - Εντομοαπωθητικά', 24, 25, '2023-05-09 16:09:11'),
(115, NULL, 'e60aca31a37a40db8a83ccf93bd116b1', 'd41744460283406a86f8e4bd5010a66d', 'Απορρυπαντικά', 22, 23, '2023-05-09 16:09:12'),
(116, NULL, 'b5d54a3d8dd045fb88d5c31ea794dcc5', 'd41744460283406a86f8e4bd5010a66d', 'Είδη κουζίνας - Μπάνιου', 20, 21, '2023-05-09 16:09:12');

-- --------------------------------------------------------

--
-- Table structure for table `stores`
--

DROP TABLE IF EXISTS `stores`;
CREATE TABLE IF NOT EXISTS `stores` (
  `id` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `shopType` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lat` float(11,7) NOT NULL,
  `lng` float(11,7) NOT NULL,
  `dateInserted` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `stores`
--

INSERT INTO `stores` (`id`, `name`, `shopType`, `address`, `lat`, `lng`, `dateInserted`) VALUES
('node/1643373636', 'Κρόνος', 'supermarket', '', 21.7814960, 38.3013077, '2022-12-15 05:08:24'),
('node/1643373639', '', 'supermarket', '', 21.7903824, 38.2949371, '2022-12-15 05:08:24'),
('node/1643713403', '', 'convenience', '', 21.7666721, 38.2852364, '2022-12-15 05:08:24'),
('node/1643713405', '', 'convenience', '', 21.7714539, 38.2911110, '2022-12-15 05:08:24'),
('node/1643713406', '', 'convenience', '', 21.7666073, 38.2913322, '2022-12-15 05:08:24'),
('node/1643818244', '', 'convenience', '', 21.7625465, 38.2779121, '2022-12-15 05:08:24'),
('node/1643818267', '', 'convenience', '', 21.7574024, 38.2751617, '2022-12-15 05:08:24'),
('node/1643818277', '', 'supermarket', '', 21.7629166, 38.2756958, '2022-12-15 05:08:24'),
('node/1643818281', 'Σκλαβενίτης', 'supermarket', '', 21.7489662, 38.2596474, '2022-12-15 05:08:24'),
('node/1643825320', '', 'convenience', '', 21.7883129, 38.2945023, '2022-12-15 05:08:24'),
('node/1643889596', '', 'supermarket', '', 21.7568741, 38.2126465, '2022-12-15 05:08:24'),
('node/1657132006', 'Ρουμελιώτης SUPER Market', 'supermarket', '', 21.7436123, 38.2613792, '2022-12-15 05:08:24'),
('node/1657132008', 'Σκλαβενίτης', 'supermarket', '', 21.7415829, 38.2585220, '2022-12-15 05:08:24'),
('node/1657962066', '', 'convenience', '', 21.7854996, 38.2991371, '2022-12-15 05:08:24'),
('node/1695934267', '', 'convenience', '', 21.7712803, 38.2915421, '2022-12-15 05:08:24'),
('node/1763830009', 'My market', 'supermarket', 'Καλαβρύτων 52-56', 21.7473259, 38.2323875, '2022-12-15 05:08:24'),
('node/1763830474', 'ΑΒ Βασιλόπουλος', 'supermarket', '', 21.7257290, 38.2322388, '2022-12-15 05:08:24'),
('node/1770994538', 'Markoulas', 'supermarket', '', 21.7603626, 38.2644958, '2022-12-15 05:08:24'),
('node/1771512424', '', 'convenience', '', 21.7593250, 38.2657852, '2022-12-15 05:08:24'),
('node/1815896581', 'Lidl', 'supermarket', '', 21.8051338, 38.3067551, '2022-12-15 05:08:24'),
('node/1971240515', 'Ανδρικόπουλος', 'supermarket', '', 21.7363701, 38.2399864, '2022-12-15 05:08:24'),
('node/1971240518', '', 'convenience', '', 21.7399006, 38.2377129, '2022-12-15 05:08:24'),
('node/1971247760', 'Σκλαβενίτης', 'supermarket', '', 21.7373409, 38.2364960, '2022-12-15 05:08:24'),
('node/1971249846', 'My Market', 'supermarket', '', 21.7342358, 38.2427063, '2022-12-15 05:08:24'),
('node/1997401665', '', 'convenience', '', 21.7689400, 38.2803802, '2022-12-15 05:08:24'),
('node/1997401682', '', 'convenience', '', 21.7646313, 38.2767372, '2022-12-15 05:08:24'),
('node/3144355008', 'My market', 'supermarket', 'Αγίας Σοφίας & Αθηνών', 21.7396717, 38.2568626, '2022-12-15 05:08:24'),
('node/3354481184', 'Ανδρικόπουλος', 'supermarket', '', 21.7323284, 38.1951981, '2022-12-15 05:08:24'),
('node/354449389', 'Lidl', 'supermarket', '', 21.7126541, 38.2080307, '2022-12-15 05:08:24'),
('node/360217468', 'The Mart', 'supermarket', '', 21.7806568, 38.2893105, '2022-12-15 05:08:24'),
('node/360226900', 'Lidl', 'supermarket', 'Νοταρά 9, 26442, Πάτρα', 21.7434273, 38.2633514, '2022-12-15 05:08:24'),
('node/364381224', 'Σουπερμάρκετ Ανδρικόπουλος', 'supermarket', 'Αθηνών 23, 26504, Ρίο', 21.7908020, 38.2952080, '2022-12-15 05:08:24'),
('node/364463568', 'Σκλαβενίτης', 'supermarket', '', 21.7642078, 38.2104378, '2022-12-15 05:08:24'),
('node/4101518891', 'ΑΒ ΒΑΣΙΛΟΠΟΥΛΟΣ', 'supermarket', 'Εγνατίας', 21.7418499, 38.2565575, '2022-12-15 05:08:24'),
('node/4356067891', '', 'supermarket', '', 21.7365284, 38.2450104, '2022-12-15 05:08:24'),
('node/4356183595', 'Σκλαβενίτης', 'supermarket', '', 21.7332859, 38.2434845, '2022-12-15 05:08:24'),
('node/4357098895', '', 'convenience', '', 21.7339554, 38.2438240, '2022-12-15 05:08:24'),
('node/4357217589', '', 'supermarket', '', 21.7414227, 38.2524300, '2022-12-15 05:08:24'),
('node/4357425491', '', 'supermarket', '', 21.7423916, 38.2512741, '2022-12-15 05:08:24'),
('node/4357589496', 'Ανδρικόπουλος', 'supermarket', '', 21.7302551, 38.2427979, '2022-12-15 05:08:24'),
('node/4358244594', '', 'supermarket', '', 21.7337189, 38.2454109, '2022-12-15 05:08:24'),
('node/4372108797', 'Mini Market', 'convenience', '', 21.8365002, 38.2725792, '2022-12-15 05:08:24'),
('node/4484528391', 'Carna', 'convenience', 'Εθνική Οδός 8α', 21.7667141, 38.2795372, '2022-12-15 05:08:24'),
('node/4752810729', 'Mini Market', 'convenience', '', 21.7770004, 38.3052406, '2022-12-15 05:08:24'),
('node/4931300543', 'Kronos', 'supermarket', '', 21.7296429, 38.2425804, '2022-12-15 05:08:24'),
('node/4953268497', 'Φίλιππας', 'convenience', '', 21.7504673, 38.2585640, '2022-12-15 05:08:24'),
('node/4969309651', '', 'supermarket', '', 21.7940998, 38.3015022, '2022-12-15 05:08:24'),
('node/5005384516', 'No supermarket', 'supermarket', '', 21.7363358, 38.2498055, '2022-12-15 05:08:24'),
('node/5005409493', 'Kiosk', 'convenience', '', 21.7351284, 38.2490845, '2022-12-15 05:08:24'),
('node/5005409494', 'Kiosk', 'convenience', '', 21.7349110, 38.2493172, '2022-12-15 05:08:24'),
('node/5005409495', 'Kiosk', 'convenience', '', 21.7344418, 38.2489548, '2022-12-15 05:08:24'),
('node/5005476710', 'Kiosk', 'convenience', '', 21.7413063, 38.2569885, '2022-12-15 05:08:24'),
('node/5005476711', 'Kiosk', 'convenience', '', 21.7409534, 38.2561417, '2022-12-15 05:08:24'),
('node/5132918123', '', 'supermarket', '', 21.7400703, 38.2523689, '2022-12-15 05:08:24'),
('node/5164678230', 'Ανδρικόπουλος - Supermarket', 'supermarket', 'Αξιού 1 - 3, 26442, Πάτρα', 21.7481499, 38.2691956, '2022-12-15 05:08:24'),
('node/5164741179', 'Σκλαβενίτης', 'supermarket', 'Νοταρά', 21.7497005, 38.2690964, '2022-12-15 05:08:24'),
('node/5350727524', '', 'supermarket', '', 21.7251663, 38.2338257, '2022-12-15 05:08:24'),
('node/5396345464', 'Mini Market', 'convenience', '', 21.8764229, 38.3277397, '2022-12-15 05:08:24'),
('node/5620198221', 'ΑΒ Βασιλόπουλος', 'supermarket', '', 21.7357788, 38.2170944, '2022-12-15 05:08:24'),
('node/5620208927', 'Mini Market', 'convenience', '', 21.7321205, 38.2160263, '2022-12-15 05:08:24'),
('node/5783486253', '', 'supermarket', '', 21.8203449, 38.3127403, '2022-12-15 05:08:24'),
('node/5909978406', '', 'supermarket', '', 21.7312412, 38.2451859, '2022-12-15 05:08:24'),
('node/598279836', 'Papakos', 'convenience', '', 21.7622776, 38.2355309, '2022-12-15 05:08:24'),
('node/633369803', '', 'convenience', '', 21.7540245, 38.2612915, '2022-12-15 05:08:24'),
('node/7673935764', '3A', 'supermarket', '', 21.7396679, 38.2504501, '2022-12-15 05:08:24'),
('node/7673976786', 'Spar', 'supermarket', '', 21.7389774, 38.2486305, '2022-12-15 05:08:24'),
('node/7673986831', 'ΑΝΔΡΙΚΟΠΟΥΛΟΣ', 'supermarket', '', 21.7383232, 38.2481537, '2022-12-15 05:08:24'),
('node/7674120315', 'ΑΝΔΡΙΚΟΠΟΥΛΟΣ', 'supermarket', '', 21.7308044, 38.2429466, '2022-12-15 05:08:24'),
('node/7677225097', 'MyMarket', 'supermarket', '', 21.7265282, 38.2392845, '2022-12-15 05:08:24'),
('node/7914886761', '', 'supermarket', '', 21.7575340, 38.2653351, '2022-12-15 05:08:24'),
('node/8214753473', 'Ena Cash And Carry', 'supermarket', '', 21.7253475, 38.2346611, '2022-12-15 05:08:24'),
('node/8214854586', 'ΚΡΟΝΟΣ - (Σκαγιοπουλείου)', 'supermarket', '', 21.7294922, 38.2358017, '2022-12-15 05:08:24'),
('node/8214887295', 'Ανδρικόπουλος Super Market', 'supermarket', '', 21.7306404, 38.2379189, '2022-12-15 05:08:24'),
('node/8214887306', '3Α Αράπης', 'supermarket', '', 21.7328987, 38.2375069, '2022-12-15 05:08:24'),
('node/8214910532', 'Γαλαξίας', 'supermarket', '', 21.7337875, 38.2361145, '2022-12-15 05:08:24'),
('node/8215010716', 'Super Market Θεοδωρόπουλος', 'supermarket', '', 21.7283115, 38.2360115, '2022-12-15 05:08:24'),
('node/8215157448', 'Super Market ΚΡΟΝΟΣ', 'supermarket', '', 21.7340717, 38.2390442, '2022-12-15 05:08:24'),
('node/8753329904', '', 'supermarket', '', 21.7396851, 38.2642288, '2022-12-15 05:08:24'),
('node/8753329905', '', 'supermarket', '', 21.7398815, 38.2658234, '2022-12-15 05:08:24'),
('node/8777081651', 'Σκλαβενίτης', 'supermarket', '', 21.7428703, 38.2601814, '2022-12-15 05:08:24'),
('node/8777171555', '3A ARAPIS', 'supermarket', '', 21.7460079, 38.2586441, '2022-12-15 05:08:24'),
('node/8805335004', 'Μασούτης', 'supermarket', '', 21.7355061, 38.2454681, '2022-12-15 05:08:24'),
('node/8805467220', 'ΑΒ Shop & Go', 'supermarket', '', 21.7380295, 38.2495689, '2022-12-15 05:08:24'),
('node/8806495733', '3Α ΑΡΑΠΗΣ', 'supermarket', '', 21.7455559, 38.2398796, '2022-12-15 05:08:24'),
('node/9651304117', 'Περίπτερο', 'convenience', '', 21.7408752, 38.2554436, '2022-12-15 05:08:24'),
('node/9785182275', '', 'convenience', '', 21.6232204, 38.1494217, '2022-12-15 05:08:24'),
('node/9785182280', '', 'convenience', '', 21.6206284, 38.1477394, '2022-12-15 05:08:24'),
('node/9785335420', '', 'convenience', '', 21.6454792, 38.1563072, '2022-12-15 05:08:24'),
('node/980515550', 'Lidl', 'supermarket', '', 21.7400818, 38.2312927, '2022-12-15 05:08:24');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `username` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'user',
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  KEY `id` (`id`),
  KEY `username_2` (`username`),
  KEY `password` (`password`),
  KEY `email` (`email`),
  KEY `type` (`type`),
  KEY `date` (`date`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `email`, `type`, `date`) VALUES
(3, 'admin', '$2y$10$R3PKteeMEYVV7OT.mg4o6e5d9fYGpZGex3sDJAeHp/EGKt.hscTkq', 'admin@gmail.com', 'admin', '2023-04-30 20:18:39');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
